spec/fixtures/stripe_webhook-checkout.session.completed.json

{
  "id": "evt_0Qv3uNm0T0GBfX0v3935IdAR",
  "object": "event",
  "api_version": "2025-01-27.acacia",
  "created": 1740173839,
  "data": {
    "object": {
      "id": "cs_test_a14VdEixSrpFjwqkENSaSEdr8THKAu5Q6wCe8tE1qJaeBB6NEAsjpYvgg4",
      "object": "checkout.session",
      "adaptive_pricing": null,
      "after_expiration": null,
      "allow_promotion_codes": null,
      "amount_subtotal": 999,
      "amount_total": 999,
      "automatic_tax": {
        "enabled": false,
        "liability": null,
        "status": null
      },
      "billing_address_collection": null,
      "cancel_url": "http://localhost:3042/membership/new",
      "client_reference_id": null,
      "client_secret": null,
      "collected_information": {
        "shipping_details": null
      },
      "consent": null,
      "consent_collection": null,
      "created": 1740173800,
      "currency": "usd",
      "currency_conversion": null,
      "custom_fields": [
      ],
      "custom_text": {
        "after_submit": null,
        "shipping_address": null,
        "submit": null,
        "terms_of_service_acceptance": null
      },
      "customer": "cus_RohIc4uZhMPzxN",
      "customer_creation": "always",
      "customer_details": {
        "address": {
          "city": null,
          "country": "US",
          "line1": null,
          "line2": null,
          "postal_code": "94110",
          "state": null
        },
        "email": "seth@bikeindex.org",
        "name": "Seth Herr",
        "phone": null,
        "tax_exempt": "none",
        "tax_ids": [
        ]
      },
      "customer_email": "seth@bikeindex.org",
      "discounts": [
      ],
      "expires_at": 1740260200,
      "invoice": "in_0Qv3uJm0T0GBfX0vXLZmSpZb",
      "invoice_creation": null,
      "livemode": false,
      "locale": null,
      "metadata": {
      },
      "mode": "subscription",
      "payment_intent": null,
      "payment_link": null,
      "payment_method_collection": "always",
      "payment_method_configuration_details": {
        "id": "pmc_0P68HJm0T0GBfX0vuIr5fXd9",
        "parent": null
      },
      "payment_method_options": {
        "card": {
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card",
        "cashapp"
      ],
      "payment_status": "paid",
      "phone_number_collection": {
        "enabled": false
      },
      "recovered_from": null,
      "saved_payment_method_options": {
        "allow_redisplay_filters": [
          "always"
        ],
        "payment_method_remove": null,
        "payment_method_save": null
      },
      "setup_intent": null,
      "shipping_address_collection": null,
      "shipping_options": [
      ],
      "status": "complete",
      "submit_type": null,
      "subscription": "sub_0Qv3uJm0T0GBfX0v77OTe6ii",
      "success_url": "http://localhost:3042/membership/success?session_id={CHECKOUT_SESSION_ID}",
      "total_details": {
        "amount_discount": 0,
        "amount_shipping": 0,
        "amount_tax": 0
      },
      "ui_mode": "hosted",
      "url": null,
      "shipping_cost": null,
      "shipping_details": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "checkout.session.completed"
}
